<?php


$abbreviation_eng = [
    'n.' => 'noun',
    'a.' => 'adjective' ,
    'adv.' => 'adverb',
    'attr.' => 'attributive',
    'conj.' => 'conjunction',
    'etc.' => 'etc',
    'imp.' => 'imperative',
    'inf.' => 'infinitive',
    'int.' => 'interjenction',
    'num.' => 'numeral',
    'o.s.' => 'oneself',
    'p. p.' => 'past_participle',
    'pass.' => 'passive',
    'past.' => 'past_tense',
    'pl.' => 'plural',
    'pref.' => 'prefix',
    'pres.p.' => 'present_participle',
    'pron.' => 'pronoun',
    'prep.' => 'preposition',
    'refl.' => 'reflexive',
    'syn.' => 'synonym',
    'smb.' => 'somebody',
    'smth.' => 'something',
    's.o.' => 'someone',
    'v.' => 'verb',
    'vi.' => 'verb_intransitive',
    'vt.' => 'verb_transitive'
];
$abbreviation_rus = [
    'ав.' => 'авиация',
    'австрал.' => 'австалийская терминология',
    'авт.' => 'автотранспорт',
    'ам.' => 'американская терминология',
    'анат.' => 'анатомия',
    'англ.' => 'английская терминология',
    'англоинд.' => 'англоиндийская терминология',
    'араб.' => 'арабская терминология',
    'арт.' => 'артиллерия',
    'арх.' => 'архитектура',
    'археол.' => 'археология',
    'астр.' => 'астрономия',
    'астрол.' => 'астрология',
    'бакт.' => 'бактериология',
    'библ.' => 'библейская терминология',
    'биол.' => 'биология',
    'бирж.' => 'биржевая терминология',
    'бот.' => 'ботаника',
    'букв.' => 'буквально',
    'бухг.' => 'бухгалтерская терминология',
    'вет.' => 'ветеринария',
    'вм.' => 'вместо',
    'воен.' => 'военное дело',
    'вопрос.' => 'вопросительный',
    'в разн. знач.'  => 'в разных значениях',
    'вульг.' => 'вульгаризм',
    'г.' => 'город',
    'генет.' => 'генетика',
    'геогр.' => 'география',
    'геод.' => 'геодезия',
    'геол.' => 'геология',
    'геом.' => 'геометрия',
    'гер.' => 'геральдика',
    'гидр.' => 'гидротехника',
    'гл.' => 'главным',
    'глаг.' => 'глагол',
    'голл.' => 'голландская терминология',
    'горн.' => 'горное дело',
    'грам.' => 'грамматика',
    'греч.' => 'греческая терминология',
    'груб.' => 'грубое слово или выражение',
    'дет.' => 'детская терминология',
    'диал.' => 'диалектизм',
    'дип.' => 'дипломатический термин',
    'др.-греч.' => 'древнегреческая история',
    'др.-рим.' => 'древнеримская история',
    'ед.ч.' => 'единственное число',
    'жарг.' => 'жаргонный термин',
    'жив.' => 'живопись',
    'ж.р.' => 'женский род',
    'ж.-д.' => 'железнодорожный термин',
    'зоол.' => 'зоология',
    'и др.' => 'и другое',
    'и пр.' => 'и прочее',
    'инд.' => 'индийская терминология',
    'ирл.' => 'ирландская терминология',
    'ирон.' => 'иронично',
    'иск.' => 'искусство',
    'исп.' => 'испанская терминология',
    'ист.' => 'исторический термин',
    'и т.п.' => 'и тому подобное',
    'итал.' => 'итальянская терминология',
    'карт.' => 'термин карточной игры',
    'кино' => 'кинематография',
    'кит' => 'китайская терминология',
    'ком.' => 'коммерческий термин',
    'комп.' => 'информатика и компьютерные технологии',
    'кул.' => 'кулинария',
    'л.' => 'лицо',
    'ласк.' => 'ласкательное слово или выражение',
    'лат.' => 'латинский термин',
    'лес.' => 'лесное дело',
    'лингв.' => 'лингвистика',
    'лит.' => 'литература',
    'лог.' => 'логика',
    'мат.' => 'математика',
    'мед.' => 'медицина',
    'мест.' => 'местоимение',
    'метал.' => 'металлургия',
    'метеор.' => 'метеорология',
    'метр.' => 'метрология',
    'мех.' => 'механика',
    'мин.' => 'минералогия',
    'миф.' => 'мифология',
    'мн.ч.' => 'множественное число',
    'мор.' => 'морское дело',
    'муз.' => 'музыка',
    'накл.' => 'наклонение',
    'напр.' => 'например',
    'нареч.' => 'наречие',
    'науч.' => 'научная терминология',
    'нач.' => 'начало',
    'нем.' => 'немецкая терминология',
    'неол.' => 'неологизм',
    'обыкн.' => 'обыкновенно',
    'опт.' => 'оптика',
    'особ.' => 'особенно',
    'охот.' => 'охотничий термин',
    'офиц.' => 'официальное выражение',
    'парл.' => 'парламентский термин',
    'перен.' => 'в переносном значении',
    'погов.' => 'поговорка',
    'пол.' => 'политический термин',
    'полигр.' => 'полиграфия',
    'португ.' => 'португальская терминология',
    'посл.' => 'пословица',
    'поэт.' => 'поэтический термин',
    'превосх.' => 'превосходная',
    'предл.' => 'предложение',
    'предлог.' => 'предлогами',
    'презр.' => 'презрительно',
    'преим.' => 'преимущественно',
    'пренебр.' => 'пренебрежительно',
    'прибл.' => 'приблизительно',
    'прилаг.' => 'имя пралагательное',
    'притяж.' => 'притяжательное местоимение',
    'прям.' => 'в прямом значении',
    'психол.' => 'психология',
    'р.' => 'род',
    'рад.' => 'радиотехника',
    'разг.' => 'разговорное выражение',
    'распр.' => 'распространительно',
    'редк.' => 'редко употребляемое слово',
    'рел.' => 'религия',
    'рит.' => 'риторика',
    'род.' => 'родительный (падеж)',
    'св.' => 'святой',
    'сказ.' => 'сказочная терминология',
    'см.' => 'смотри',
    'собир.' => 'собирательное выражение',
    'сокр.' => 'сокращение',
    'сослаг.' => 'сослагательный',
    'спорт.' => 'физкультура и спорт',
    'ср.' => 'сравни',
    'сравнит.' => 'сравнительная',
    'ср.-век.' => 'средневековый',
    'степ.' => 'степень',
    'стр.' => 'строительный термин',
    'сущ.' => 'имя существительное',
    'с.-х.' => 'сельское хозяйство',
    'твор.' => 'творительный (падеж)',
    'т.е.' => 'то есть',
    'театр.' => 'театральный термин',
    'текст.' => 'текстильное дело',
    'тел.' => 'телефония',
    'телев.' => 'телевидение',
    'тех.' => 'техника',
    'тж.' => 'также',
    'топогр.' => 'топография',
    'тур.' => 'турецкая терминология',
    'уменьш.' => 'уменьшительная форма',
    'унив.' => 'универскитетский термин',
    'употр.' => 'употребляется',
    'уст.' => 'устаревшее слово или выражение',
    'утверд.' => 'утвердительный',
    'фарм.' => 'фармакология',
    'физ.' => 'физика',
    'физиол.' => 'физиология',
    'филол.' => 'филология',
    'филос.' => 'философия',
    'фин.' => 'финансковый термин',
    'фон.' => 'фонетика',
    'фот.' => 'фотография',
    'фр.' => 'французская терминология',
    'футб.' => 'футбол',
    'хим.' => 'химия',
    'хир.' => 'хирургия',
    'церк.' => 'церковный термин',
    'что-н.' => 'что-нибудь',
    'шахм.' => 'шахматный термин',
    'шк.' => 'школьное выражение',
    'шотл.' => 'шотландская терминология',
    'шутл.' => 'шутливое выражение',
    'эвф.' => 'эвфемизм',
    'эк.' => 'экономика',
    'эл.' => 'электроника',
    'южноафр.' => 'юэноафриканская терминология',
    'юр.' => 'юридический термин',
    'яп.' => 'японская терминология'
];



function compileObject(){
    $xml = file_get_contents('dict_lite.xdxf');

    $xml_object = explode("<ar>", $xml);

    unset($xml_object[0]);
    foreach ($xml_object as $object){
        $data = [
            'origin' => '',
            'transcription' => '',
            'translation' => ''
        ];
        $origin = explode('</k>',$object);
        if(strpos($origin[1], '</tr>')){
            $transcription_and_translation  = explode('</tr>',$origin[1]);
            $data['transcription']= str_replace('<tr>', '', $transcription_and_translation[0]);
            $data['translation']= str_replace('</ar>', '', $transcription_and_translation[1]);
        } else {
            $data['translation']= str_replace('</ar>', '', $origin[1]);
        }
        $data['origin']= str_replace('<k>', '', $origin[0]);
        
        $data['translation'] = compileTranslation($data['translation']);
        print_r($data);
        }
}
function compileTranslation($translation_string){
    $result_object = [];
    $abbreviation_eng = findAbbreviationEng($translation_string);
    if($abbreviation_eng){
        $result_object['abbreviation_eng'] = $abbreviation_eng['abbreviation_eng'];
        $translation_string = $abbreviation_eng['word'];
    }
    if(strpos($translation_string,'1&gt;')>-1){
        $result_object['word'] = explode('gt;', $translation_string );
        for($i = 0; $i<count($result_object['word']); $i++){
           if(strpos($result_object['word'][$i],($i+1).'&')>-1){
               $result_object['word'][$i] = str_replace(($i+1).'&', '', $result_object['word'][$i]);
           }
          
           if(!isset($result_object['word'][$i])){
               unset($result_object['word'][$i]);
               continue;
           }
           $abbreviation_rus = findAbbreviationRus($result_object['word'][$i]);
            if($abbreviation_rus){
                $result_object['word'][$i] = $abbreviation_rus;
            }
        }
    }
    return $result_object;
}

function findAbbreviationEng($word_string){
    error_reporting(0);
    global $abbreviation_eng;
    foreach ($abbreviation_eng as $abbr_eng=>$value){
        if (strpos($word_string,'_'.$abbr_eng)){
            $new_word_string = str_replace('_'.$abbr_eng, '', $word_string);
            return $meaning_object = [
                'word' => $new_word_string,
                'abbreviation_eng' => $value
            ];
        } else {
            continue;
        }
    }
    error_reporting(1);
}

function findAbbreviationRus($word_string){
    error_reporting(0);
    global $abbreviation_rus;
    $meaning_object = [
                'word' => $word_string,
                'abbreviation_rus' => []
    ];
    foreach ($abbreviation_rus as $abbr_rus=>$value){
        if (strpos($meaning_object['word'],'_'.$abbr_rus)){
            $new_word_string = str_replace('_'.$abbr_rus,'', $meaning_object['word']);
            $meaning_object['word'] = $new_word_string;
            array_push($meaning_object['abbreviation_rus'],$value);
        } else {
             continue;
        }
    }
    error_reporting(1);
    return $meaning_object;
}
compileObject();